app/views/posts/index.html.erb

					<div class="mystyle">
						<%= post.comments.count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 4