app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 4
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 4
---
<h2> <%=link_to @post.title, @post.url%> </h2>
<h6> No. of comments: <%= @post.comments.count %> </h6>