app/controllers/comments_controller.rb

	def index
		@post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]