app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment])
		if @comment.errors.any?
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "comment"], ["created_at", Thu, 20 Dec 2012 04:12:19 UTC +00:00], ["post_id", 4], ["updated_at", Thu, 20 Dec 2012 04:12:19 UTC +00:00]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 4