app/controllers/posts_controller.rb

	def show
		@post = Post.find(params[:id])
		@comments = Comment.find(@post.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 4]]

	def create
		title = params[:title]
		url = params[:url]
		post = Post.new(title: title, url: url)
		post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Sun, 16 Dec 2012 21:49:15 UTC +00:00], ["title", nil], ["updated_at", Sun, 16 Dec 2012 21:49:15 UTC +00:00], ["url", nil]]