app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'shilpi' LIMIT 1
---
	def create
		user = User.where(username: params[:username]).first