app/controllers/votes_controller.rb

	def create
		post = Post.find(params[:post_id])
		post.votes.create(direction: params[:direction])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "votes" ("created_at", "direction", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 24 Dec 2012 03:41:19 UTC +00:00], ["direction", "up"], ["post_id", 4], ["updated_at", Mon, 24 Dec 2012 03:41:19 UTC +00:00]]